### string functions

In [2]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np
engine = create_engine('mysql+pymysql://root:root1234@localhost')

In [3]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [4]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

             Database
0  information_schema
1               mysql
2  performance_schema
3        sql_practice
4                 sys
5        wordpress_db

In [5]:
query = """
create database sql_practice;
"""
get_query_result(query)

Query execution failed: (pymysql.err.ProgrammingError) (1007, "Can't create database 'sql_practice'; database exists")
[SQL:
create database sql_practice;
]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
query = """
show databases;
"""
get_query_result(query)

Query executed successfully and returned data.

             Database
0  information_schema
1               mysql
2  performance_schema
3        sql_practice
4                 sys
5        wordpress_db

In [7]:
query = """
use sql_practice;
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [8]:
query = """
show tables;
"""
get_query_result(query)

Query executed successfully and returned data.

Empty DataFrame
Columns: [Tables_in_sql_practice]
Index: []

In [9]:
"""CREATE TABLE books 
	(
		book_id INT AUTO_INCREMENT,
		title VARCHAR(100),
		author_fname VARCHAR(100),
		author_lname VARCHAR(100),
		released_year INT,
		stock_quantity INT,
		pages INT,
		PRIMARY KEY(book_id)
	);

INSERT INTO books (title, author_fname, author_lname, released_year, stock_quantity, pages)
VALUES
('The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
('Norse Mythology', 'Neil', 'Gaiman',2016, 43, 304),
('American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
('Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
('A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
('The Circle', 'Dave', 'Eggers', 2013, 26, 504),
('The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
('Just Kids', 'Patti', 'Smith', 2010, 55, 304),
('A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
('Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
('What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
("Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
('White Noise', 'Don', 'DeLillo', 1985, 49, 320),
('Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
('Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
('Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343);"""

'CREATE TABLE books \n\t(\n\t\tbook_id INT AUTO_INCREMENT,\n\t\ttitle VARCHAR(100),\n\t\tauthor_fname VARCHAR(100),\n\t\tauthor_lname VARCHAR(100),\n\t\treleased_year INT,\n\t\tstock_quantity INT,\n\t\tpages INT,\n\t\tPRIMARY KEY(book_id)\n\t);\n\nINSERT INTO books (title, author_fname, author_lname, released_year, stock_quantity, pages)\nVALUES\n(\'The Namesake\', \'Jhumpa\', \'Lahiri\', 2003, 32, 291),\n(\'Norse Mythology\', \'Neil\', \'Gaiman\',2016, 43, 304),\n(\'American Gods\', \'Neil\', \'Gaiman\', 2001, 12, 465),\n(\'Interpreter of Maladies\', \'Jhumpa\', \'Lahiri\', 1996, 97, 198),\n(\'A Hologram for the King: A Novel\', \'Dave\', \'Eggers\', 2012, 154, 352),\n(\'The Circle\', \'Dave\', \'Eggers\', 2013, 26, 504),\n(\'The Amazing Adventures of Kavalier & Clay\', \'Michael\', \'Chabon\', 2000, 68, 634),\n(\'Just Kids\', \'Patti\', \'Smith\', 2010, 55, 304),\n(\'A Heartbreaking Work of Staggering Genius\', \'Dave\', \'Eggers\', 2001, 104, 437),\n(\'Coraline\', \'Neil\', \'Gaiman\', 2003, 100, 208),\n(\'What We Talk About When We Talk About Love: Stories\', \'Raymond\', \'Carver\', 1981, 23, 176),\n("Where I\'m Calling From: Selected Stories", \'Raymond\', \'Carver\', 1989, 12, 526),\n(\'White Noise\', \'Don\', \'DeLillo\', 1985, 49, 320),\n(\'Cannery Row\', \'John\', \'Steinbeck\', 1945, 95, 181),\n(\'Oblivion: Stories\', \'David\', \'Foster Wallace\', 2004, 172, 329),\n(\'Consider the Lobster\', \'David\', \'Foster Wallace\', 2005, 92, 343);'

In [10]:
query = """
create table books(
    book_id int not null primary key auto_increment
);
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [11]:
query = """
desc books;
"""
get_query_result(query)

Query executed successfully and returned data.

     Field Type Null  Key Default           Extra
0  book_id  int   NO  PRI    None  auto_increment

In [12]:
query = """
alter table books
add 
title varchar(100);
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [13]:
query = """
alter table books
add 
(
    author_last_name varchar(100),
    release_year int,
    stock_quantity int,
    pages int
);
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [14]:
query = """
desc books;
"""
get_query_result(query)

Query executed successfully and returned data.

              Field          Type Null  Key Default           Extra
0           book_id           int   NO  PRI    None  auto_increment
1             title  varchar(100)  YES         None
2  author_last_name  varchar(100)  YES         None
3      release_year           int  YES         None
4    stock_quantity           int  YES         None
5             pages           int  YES         None

In [18]:
query = """
insert into books(title,author_first_name,author_last_name,release_year,stock_quantity,pages)
values 
('The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
('Norse Mythology', 'Neil', 'Gaiman',2016, 43, 304),
('American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
('Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
('A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
('The Circle', 'Dave', 'Eggers', 2013, 26, 504),
('The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
('Just Kids', 'Patti', 'Smith', 2010, 55, 304),
('A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
('Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
('What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
("Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
('White Noise', 'Don', 'DeLillo', 1985, 49, 320),
('Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
('Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
('Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343);
"""
get_query_result(query)

Query executed successfully
Rowcount: 16
Returns Rows: False

In [17]:
query = """
alter table books
add 
(
    author_first_name varchar(100)
);
"""
get_query_result(query)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [19]:
query = """
select * from books;
"""
get_query_result(query)

Query executed successfully and returned data.

,book_id,title,author_last_name,release_year,stock_quantity,pages,author_first_name
0,1,The Namesake,Lahiri,2003,32,291,Jhumpa
1,2,Norse Mythology,Gaiman,2016,43,304,Neil
2,3,American Gods,Gaiman,2001,12,465,Neil
3,4,Interpreter of Maladies,Lahiri,1996,97,198,Jhumpa
4,5,A Hologram for the King: A Novel,Eggers,2012,154,352,Dave
5,6,The Circle,Eggers,2013,26,504,Dave
6,7,The Amazing Adventures of Kavalier & Clay,Chabon,2000,68,634,Michael
7,8,Just Kids,Smith,2010,55,304,Patti
8,9,A Heartbreaking Work of Staggering Genius,Eggers,2001,104,437,Dave
9,10,Coraline,Gaiman,2003,100,208,Neil
10,11,What We Talk About When We Talk About Love: St...,Carver,1981,23,176,Raymond
11,12,Where I'm Calling From: Selected Stories,Carver,1989,12,526,Raymond
12,13,White Noise,DeLillo,1985,49,320,Don
13,14,Cannery Row,Steinbeck,1945,95,181,John
14,15,Oblivion: Stories,Foster Wallace,2004,172,329,David
15,16,Consider the Lobster,Foster Wallace,2005,92,343,David

go to the data.sql dir

mysql -u root -p

create database if not exists
use database

source data.sql

In [32]:
### concat

In [33]:
query = """
select concat('h','i');
"""
get_query_result(query)

Query executed successfully and returned data.

  concat('h','i')
0              hi

### concat

In [35]:
query = """
select concat(author_first_name,' ',author_last_name) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

   concat(author_first_name,' ',author_last_name)
0                                   Jhumpa Lahiri
1                                     Neil Gaiman
2                                     Neil Gaiman
3                                   Jhumpa Lahiri
4                                     Dave Eggers
5                                     Dave Eggers
6                                  Michael Chabon
7                                     Patti Smith
8                                     Dave Eggers
9                                     Neil Gaiman
10                                 Raymond Carver
11                                 Raymond Carver
12                                    Don DeLillo
13                                 John Steinbeck
14                           David Foster Wallace
15                           David Foster Wallace

In [42]:
query = """
select concat_ws(' ',author_first_name,author_last_name) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

   concat_ws(' ',author_first_name,author_last_name)
0                                      Jhumpa Lahiri
1                                        Neil Gaiman
2                                        Neil Gaiman
3                                      Jhumpa Lahiri
4                                        Dave Eggers
5                                        Dave Eggers
6                                     Michael Chabon
7                                        Patti Smith
8                                        Dave Eggers
9                                        Neil Gaiman
10                                    Raymond Carver
11                                    Raymond Carver
12                                       Don DeLillo
13                                    John Steinbeck
14                              David Foster Wallace
15                              David Foster Wallace

### substring or substr

In [47]:
query = """
select substring('hello',-1);
"""
get_query_result(query)

Query executed successfully and returned data.

  substring('hello',-1)
0                     o

In [48]:
query = """
select substring(title,-10) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

   substring(title,-10)
0            e Namesake
1             Mythology
2            rican Gods
3            f Maladies
4            g: A Novel
5            The Circle
6            ier & Clay
7
8            ing Genius
9
10           e: Stories
11           ed Stories
12           hite Noise
13           annery Row
14           n: Stories
15           he Lobster

In [54]:
query = """
select title from books where book_id=10;
"""
get_query_result(query)

Query executed successfully and returned data.

      title
0  Coraline

In [55]:
query = """
select concat(substring(title,-10),'...') from books;
"""
get_query_result(query)

Query executed successfully and returned data.

   concat(substring(title,-10),'...')
0                       e Namesake...
1                        Mythology...
2                       rican Gods...
3                       f Maladies...
4                       g: A Novel...
5                       The Circle...
6                       ier & Clay...
7                                 ...
8                       ing Genius...
9                                 ...
10                      e: Stories...
11                      ed Stories...
12                      hite Noise...
13                      annery Row...
14                      n: Stories...
15                      he Lobster...

In [ ]:
query = """
select concat(substring(title,-10),'...') from books;
"""
get_query_result(query)

### replace

In [57]:
query = """
select replace('hello world','he','');
"""
get_query_result(query)

Query executed successfully and returned data.

  replace('hello world','he','')
0                      llo world

In [58]:
query = """
select replace(title,'Namesake','') from books;
"""
get_query_result(query)

Query executed successfully and returned data.

                         replace(title,'Namesake','')
0                                                The
1                                     Norse Mythology
2                                       American Gods
3                             Interpreter of Maladies
4                    A Hologram for the King: A Novel
5                                          The Circle
6           The Amazing Adventures of Kavalier & Clay
7                                           Just Kids
8           A Heartbreaking Work of Staggering Genius
9                                            Coraline
10  What We Talk About When We Talk About Love: St...
11           Where I'm Calling From: Selected Stories
12                                        White Noise
13                                        Cannery Row
14                                  Oblivion: Stories
15                               Consider the Lobster

In [59]:
query = """
select * from books;
"""
get_query_result(query)

Query executed successfully and returned data.

,book_id,title,author_first_name,author_last_name,release_year,stock_quantity,pages
0,1,The Namesake,Jhumpa,Lahiri,2003,32,291
1,2,Norse Mythology,Neil,Gaiman,2016,43,304
2,3,American Gods,Neil,Gaiman,2001,12,465
3,4,Interpreter of Maladies,Jhumpa,Lahiri,1996,97,198
4,5,A Hologram for the King: A Novel,Dave,Eggers,2012,154,352
5,6,The Circle,Dave,Eggers,2013,26,504
6,7,The Amazing Adventures of Kavalier & Clay,Michael,Chabon,2000,68,634
7,8,Just Kids,Patti,Smith,2010,55,304
8,9,A Heartbreaking Work of Staggering Genius,Dave,Eggers,2001,104,437
9,10,Coraline,Neil,Gaiman,2003,100,208
10,11,What We Talk About When We Talk About Love: St...,Raymond,Carver,1981,23,176
11,12,Where I'm Calling From: Selected Stories,Raymond,Carver,1989,12,526
12,13,White Noise,Don,DeLillo,1985,49,320
13,14,Cannery Row,John,Steinbeck,1945,95,181
14,15,Oblivion: Stories,David,Foster Wallace,2004,172,329
15,16,Consider the Lobster,David,Foster Wallace,2005,92,343

### reverse

In [60]:
query = """
select reverse('hello');
"""
get_query_result(query)

Query executed successfully and returned data.

  reverse('hello')
0            olleh

In [61]:
query = """
select reverse(title) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

                                       reverse(title)
0                                        ekasemaN ehT
1                                     ygolohtyM esroN
2                                       sdoG naciremA
3                             seidalaM fo reterpretnI
4                    levoN A :gniK eht rof margoloH A
5                                          elcriC ehT
6           yalC & reilavaK fo serutnevdA gnizamA ehT
7                                           sdiK tsuJ
8           suineG gnireggatS fo kroW gnikaerbtraeH A
9                                            enilaroC
10  seirotS :evoL tuobA klaT eW nehW tuobA klaT eW...
11           seirotS detceleS :morF gnillaC m'I erehW
12                                        esioN etihW
13                                        woR yrennaC
14                                  seirotS :noivilbO
15                               retsboL eht redisnoC

### char_length

In [62]:
query = """
select char_length('hello');
"""
get_query_result(query)

Query executed successfully and returned data.

   char_length('hello')
0                     5

In [63]:
query = """
select char_length(title) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

    char_length(title)
0                   12
1                   15
2                   13
3                   23
4                   32
5                   10
6                   41
7                    9
8                   41
9                    8
10                  51
11                  40
12                  11
13                  11
14                  17
15                  20

### upper and lower

In [64]:
query = """
select UPPER(title) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

                                         UPPER(title)
0                                        THE NAMESAKE
1                                     NORSE MYTHOLOGY
2                                       AMERICAN GODS
3                             INTERPRETER OF MALADIES
4                    A HOLOGRAM FOR THE KING: A NOVEL
5                                          THE CIRCLE
6           THE AMAZING ADVENTURES OF KAVALIER & CLAY
7                                           JUST KIDS
8           A HEARTBREAKING WORK OF STAGGERING GENIUS
9                                            CORALINE
10  WHAT WE TALK ABOUT WHEN WE TALK ABOUT LOVE: ST...
11           WHERE I'M CALLING FROM: SELECTED STORIES
12                                        WHITE NOISE
13                                        CANNERY ROW
14                                  OBLIVION: STORIES
15                               CONSIDER THE LOBSTER

In [65]:
query = """
select lower(title) from books;
"""
get_query_result(query)

Query executed successfully and returned data.

                                         lower(title)
0                                        the namesake
1                                     norse mythology
2                                       american gods
3                             interpreter of maladies
4                    a hologram for the king: a novel
5                                          the circle
6           the amazing adventures of kavalier & clay
7                                           just kids
8           a heartbreaking work of staggering genius
9                                            coraline
10  what we talk about when we talk about love: st...
11           where i'm calling from: selected stories
12                                        white noise
13                                        cannery row
14                                  oblivion: stories
15                               consider the lobster

### insert

In [67]:
query = """
select insert("hello world",6,0,' buddy');
"""
get_query_result(query)

Query executed successfully and returned data.

  insert("hello world",6,0,' buddy')
0                  hello buddy world

In [68]:
query = """
select insert("hello world",6,3,' buddy');
"""
get_query_result(query)

Query executed successfully and returned data.

  insert("hello world",6,3,' buddy')
0                     hello buddyrld

In [5]:
query = """
select left("hello world",6);
"""
get_query_result(query)

Query executed successfully and returned data.

  left("hello world",6)
0                hello

In [6]:
query = """
select right("hello world",6);
"""
get_query_result(query)

Query executed successfully and returned data.

  right("hello world",6)
0                  world